#include <iostream>

using namespace std;

int main() {
    int utensils[2][12] = { {3, 3, 3, 3, 4, 3, 3, 3, 3, 4, 3, 3}, 
                            {3, 3, 3, 3, 4, 3, 3, 3, 3, 4, 3, 3} }; // массив для количества приборов

    int plates[2][12] = { {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3},
                           {2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3} }; // массив для количества тарелок

    int chairs[2][12] = { {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, 
                          {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1} }; // массив для количества стульев

    chairs[0][4] += 1; // на пятое место первого ряда был добавлен ещё один стул
    utensils[1][2] -= 1; // со второго ряда, третьего места была украдена ложка
    utensils[0][3] += 1; // любая VIP-персона поделилась своей ложкой с тем, кто остался без ложки
    plates[0][11] -= 1; // официант забрал у VIP-гостя одну десертную тарелку

    for (int i = 0; i < 2; i++) {
        for (int j = 0; j < 12; j++) {
            cout << "Row " << i + 1 << ", Seat " 
                 << j + 1 << ": Utensils - " 
                 << utensils[i][j] << ", Plates - " 
                 << plates[i][j] << ", Chairs - " 
                 << chairs[i][j] << endl;
        }
    }

    return 0;
}